作业
1.苹果近两年WWDC都发布了什么新技术？
2014 WWDC
1.Handoff
2.iOS8中增强iMessage功能，提供了HealthKit
3.开放了输入法接口，允许第三方提供输入法
4.开放了Touch ID, 允许第三方应用获取指纹信息
5.Homekit为智能硬件开放了不少可以互操作的接口
6.推出Swift
7.六项交互级权限开放

2015 WWDC
1.发布OS X EI Captain，新系统增加了多种触控板手势。
2.iOS9苹果开发的Proactive 将把 Siri、联系人、日历、Passbook、地图以及第三方应用程序整合在一起。
3.iOS 9的虚拟键盘中新增双指手势用于选取文本段落和复制粘贴、字体调节和格式快捷键。并在ipad上推出了分屏功能。
4.Watch OS，可DIY锁屏表盘背景界面，可查看不同时间段事件，支持横屏显示，新增联系人分组， 使用Siri语音回复邮件，增加Apple Pay支付卡管理界面，并且Apple Watch可独立连接耳机、WiFi等外部设备，并在APP中能够直接发送语音信息和短视频播放等功能。

2、苹果公司四十年来里程碑式的产品有哪些？
经典产品：Apple II(1977) 诞生于1977年的Apple II是苹果第一款大规模量产机型，正是这款产品奠定了苹果帝国的基业，其易用性至今还被粉丝津津乐道。Apple II是两位苹果创始人真正的智慧结晶，其生命周期长达惊人的17年。
失败产品：Apple III(1980) Apple II带来的苹果热潮还没维持几年就被Apple III给毁了，这款产品刚发售时稳定性极差，还很容易过热。Apple III是苹果第一款企业级产品，但由于开发周期过短，在制作文档时该机经常会崩溃，这也是苹果第一次在商业上遭遇失败，该电脑于1983年正式停产。
经典产品：麦金塔时(1984) 在连出臭棋推出Apple III和昂贵的Apple Lisa后，苹果终于凭借第一代麦金塔时缓了口气。这是世界上首款带有图形操作界面的个人电脑，图标和鼠标的组合让其操作体验进入新时代。它将电脑变成了人人都能使用的工具，奠定了现代电脑的雏形。
失败产品：牛顿掌上电脑(1993) 1993年时，乔布斯已经被董事会踢出了苹果，时任CEO约翰·斯卡利(John Sculley)推出了牛顿掌上电脑，这是苹果首款手写PDA，不过其700美元的昂贵售价让其始终无法打开销路，此外其手写识别准确度也经常遭人诟病。
失败产品：Macintosh TV(1993) 同年，苹果还发布了Macintosh TV，这个全身漆黑的家伙是电视和电脑的结合体，其售价更是达到了令人咋舌的2099美元，此外，由于使用NTSC电视卡，该产品只能在美国使用。开卖5 个月后，Macintosh TV就灰溜溜的退市了，其总销量只有1万台左右。
经典产品：iMac G3(1998) 在外漂泊数年后，乔布斯终于在1997年重返苹果。他返回苹果后主导的第一款产品就是糖果色的iMac G3，这款产品的设计师就是现在名满天下的乔纳森·伊夫。iMac G3让苹果重振声威，公司也正式开始走上复兴之路。
失败产品：USB鼠标(1998) 图中这款长得像冰球一样的鼠标随iMac G3一起发布，不过开售伊始就有用户吐槽它笨拙的设计和极差的易用性。此外，这款产品USB线也非常短，因此两年后Pro Mouse就替代了它的位置。
经典产品：iPod(2001) 2001年，乔布斯实现了自己许下的诺言，苹果用iPod格了卡带播放器的命，轻松将1000首歌曲放进用户的口袋中。虽然近些年来由于人们开始习惯于用手机听歌，iPod的销量逐步下滑，但这款产品确实是音乐界和消费电子产业的经典之作。
经典产品：iPhone(2007) 提到苹果的革命性产品，恐怕大家首先想到的就是iPhone。确实，是iPhone塑造了新时代的智能手机产业，同时它也是第一款无需触控笔就可操作的触屏设备。2007年以来，这个经典系列的总销量已经突破9亿台，成了苹果真正的摇钱树。
失败产品：iPhone耳机(2007) iPhone改变了我们的生活，但其附带耳机却配不上这个称号。虽然苹果2012年对其进行了改进，但EarPod依然由于质量差和漏音被用户吐槽。鉴于苹果已经收购了耳机厂商Beats，未来我们是否能用上更好的附带耳机呢?
经典产品：App Store(2008) 初代iPhone发布一年后，苹果又为其带来了另一个大杀器——App Store，用户可在该应用商店下载第三方应用，极大的提高了iPhone的可玩性。可以说，苹果的App Store开创了另一个产业。开张八年后，这个应用商店已经为苹果带来数百亿美元的销售收入。
经典产品：iPad(2010) 另一个能体现苹果超强前瞻眼光的产品是iPad。2010年发布时，乔布斯称其为“融合了苹果最新技术的革命性产品”，此外，其售价也较为亲民，近些年来销路一直不错。
失败产品：iPhone智能电池保护壳(2015) 对细节一丝不苟一直是苹果的座右铭，但这款智能电池保护壳却毁了苹果一世英名，因为它背后的“凸起”实在是太丑了，该产品一发布就遭到了全世界网友的嘲讽。也许只有苹果CEO蒂姆·库克认为它好看吧。
经典产品：Apple Watch(2015) 无论你是否喜欢，Apple Watch都是销量最好的智能手表，它绝对是业界标杆，其市场份额甚至达到了惊人的80%。在Apple Watch面前，其他智能手表都太嫩了。
